# print("3*4 =",3*4)
# print("* "*50)
# print(" Tomer"*4)
# print("* "*50)

# print("תומר")
# print("רמות")

# print(".  "*9)
# print(".  "*4," "*1,".  "*4)
# print(".  "*3," "*7,".  "*3)
# print(".  "*2," "*13,".  "*2)
# print(".  "*1," "*19, ".  "*1)
# print(".  "*2," "*13,".  "*2)
# print(".  "*3," "*7,".  "*3)
# print(".  "*4," "*1,".  "*4)
# print(".  "*9)
#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# print(3==4)
# print(3>2)
# print(3>0)
# print(45<12)
#print(44==55)
#print(1+2>4)
#print("@"=="@")
#print(7!=8)
#print("$#"!="a")
#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

                   #השארת שורה רווח בפלט
#print("a")
#print()      # כך משאירים שורה רווח
#print("b")

#טקסט מרובה שורות שיהיה פלט באופן דומה (3 גרשיים)
#x = """a
#b
#c """
#print(x)