#  #  - מערך שיעור רשימות

# #1
# x=[1,2]
# print(x)                        #הצגת הרשימה-עם סוגריים מרובעים

# #2
# x=[1,2]
# print(x*2)                        # הצגת הרשימה-עם סוגריים מרובעים - פעמיים כרשימה אחת

# #3
# x=[1,2]
# y=[3,4]
# print(x+y)                      #שילוב 2 הרשימות כרשימה אחת - עם סוגריים מרובעים

# #4
# x=[1,2]
# y=[3,4]
# print(x+y*2)                      #שילוב 2 הרשימות כרשימה אחת - עם סוגריים מרובעים אך רשימה וואי מוכפלת

# #5
# x=[1,2]
# y=[3,4]
# print((x+y)*2)  #                     #שילוב 2 הרשימות כרשימה אחת - עם סוגריים מרובעים מוכפלת

# #6
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x+y+z)                    #שילוב 3 הרשימות כרשימה אחת - עם סוגריים מרובעים

# #לתרגל הכפלת כל רשימה וגם את כל הרשימות-סדר פעולות 7

# #8
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x[0]+y[0]+z[0])           #תוצאת חיבור האיברים

# #9
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x[0]*2+y[0]*3+z[0]/5)           #תוצאת תרגיל בין איברי הרשימות 

# #10
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(2*(x[0]*2+y[0]*3+z[0]/5))        

#11
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x[1],y[1],z[0])           #הצגת האיברים - ללא הסוגריים המרובעים

#12
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x[0],y[1],z[2])           #הודעת שגיאה - מחוץ לתחום

# #13
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(2*(x[1]*2+y[1]*3+z[0]/5))   



# my_list=[1,2,3,4,5,6,7,8,9,10]
# e_zugi = my_list[0::2]   
# zugi=my_list[1::2]                           #שליפת כל ערך במקום זוגי ברשימה
# print(e_zugi)
# print(zugi)



# my_list = [1,2,3,4,5,6,7,8,9,10]                    
# my_list.reverse()                               #הופך את סדר האיברים ברשימה
# print(my_list)

# my_list = [1,2,3,4,5,6,7,1,1,1,8,9,10]                    
# my_list.remove(1)                               #מסיר רק את ההופעה הראשונה של האיבר שצויין
# print(my_list)

# my_list = [7,2,9,4,6,5,1,8,3,10]                    
# my_list.sort()                                  #ממיין את סדר האיברים ברשימה
# print(my_list)

my_list = [1,2,3,4,5,6,7,1,1,1,8,9,10]                    
my_list.pop(1)                                  #מסיר רק את האיבר במקום שצויין
print(my_list)

# my_list = [1,2,3,4,5,6,7,1,1,1,8,9,10]                    
# my_list.insert(0,5)                             #(5)מוסיף במקום המצויין (0) איבר נוסף
# print(my_list)

# my_list = [1,2,3,4,5,6,7,1,1,1,8,9,10]                    
# my_list.append(0)                               #(0)מוסיף לסוף הרשימה איבר נוסף
# print(my_list)

# my_list = [1,2,3,4,5,6,7,1,1,1,8,9,10]                    
# my_list.clear()                                 #מרוקן את הרשימה 
# print(my_list)

# my_list = [1,2,3,4,5,6,7,1,1,1,8,9,10]                    
# x = my_list.count(1)                            #מונה את כמות ההופעות של האיבר המצויין 
# print(x)

# my_list = [1,2,3,4,5,6,7,1,1,1,8,9,10]                    
# your_list = ["a","b"] 
# my_list.extend(your_list)                       #מוסיף רשימה שמצויינת לסוף רשימה ראשונה
# print(my_list)



# my_list = ["room","bed","stick","agg"]                    
# my_list.reverse()                             #הופך את הסדר של האיברים ברשימה
# print(my_list)

# my_list = ["farm","ear","bed","goal","car","dad","agg"]                    
# my_list.sort()                                  #ממיין את רשימת האיברים ברשימה בסדר אלפא-ביתי
# print(my_list)

# my_list = ["farm","ear","bed","goal","car","farm","dad","agg"]                    
# my_list.remove("farm")                           #מסיר רק את ההופעה הראשונה של האיבר שצויין
# print(my_list)

