
                              #שתי הפונקציות הבאות ייכנסו לתוך פונקציית מיין
#def a(x):                 #הגדרת פונקציה
#	print(x+1)            #מוסיפה לקלט 1
#a(79)                     #קריאה לפונקציה + קלט

#import math               #ייבוא מספריית מאט

#def b(x):                 #הגדרת פונקציה
#	print(math.sqrt (x))  #העלאת קלט בחזקת 2
#b(64)                     #קריאה לפונקציה + קלט

#def name(x):
#	print(x)
#name("moti")

#def main():               #הגדרת פונקציית מיין
#	a()                   #הכללת פונקצייה איי
#	b()                   #הכללת פונקצייה איי
#	name()
#if __name__== "__a__":    #תחביר מורכב לביצוע כל 2 הפונקציות שכלולות במיין
#	main()#
#

                        #הפונקציה מחברת 2 מספרים
#def add(x,y):             #הגדרת הפונקציה עם 2 פרמטרים
#	"""adding 2 num"""    #תיעוד
#	print("x+y=",x+y)     #פלט
#add(1,2)                  #קריאה לפונקציה והשמת ערכים
#help(add)                 #קריאה לתיעוד של הפונקציה דרך הלפ

                        #הפונקציה מדפיסה מילה
#def words(prati,family):                 #הגדרת הפונקציה עם 2 פרמטרים
#	"""typing a word"""                  #תיעוד
#	print("the name is:",prati,family)   #פלט
#words("moti","yair")                     #קריאה לפונקציה והשמת ערכים
#help(words)                              #קריאה לתיעוד של הפונקציה דרך הלפ

                        #הפונקציה מחברת 2 מספרים
#def add(x,y):             #הגדרת הפונקציה עם 2 פרמטרים
#	"""adding 2 num"""    #תיעוד
#	t = x+y               #הסכום נכנס לתא טי
#	return t              #הפונקציה שומרת את הסכום

#a = add(8,2)              #קריאה לפונקציה והשמת ערכים לתא איי
#print("the sum is :",a)   #פלט של הסכום

                              #חלק זה מתרגל הבדלים בין משתנה לוקלי וגלובלי
#def word():             #הגדרת פונקציה
#	a = "moti"           #השמת ערך לתא איי
#	print(a)             #פלט
#word()                  #קריאה לפונקציה

#def word():      #הגדרת פונקציה
#	a = "moti"    #השמת ערך לתא איי
#	print(a)      #פלט
#print(a)         #יציאה מהפונקציה ובקשה לפלט איי שלא מוכר מחוץ לפונקציה
                  #נקבל הודעת שגיאה ניימארור

#def word():         #הגדרת פונקציה
#	a = "moti"      #השמת ערך לתא איי
#	print(a)        #פלט
#b = "yair"          #השמת ערך לתא בי - גלובלי
#print(b)            # פלט של תא בי
#word()              #קריאה לפונקציה שתדפיס את ערך איי הלוקלי

#def word():      #הגדרת פונקציה
#	a = "moti"   #השמת ערך לתא איי
#	print(a,b)   #פלט
#b = "yair"       #השמת ערך לתא בי - גלובלי
#word()           #קריאה לפונקציה שתדפיס את ערך איי הלוקלי וגם את בי הגלובלי שנכנס לפונקציה 





#import math
#def sr(a,b,c):
#	if delta1 < 0 or
#	x1 = (-b + math.sqrt(b**2-4*a*c))/2*a
#	x2 = (-b - math.sqrt(b**2-4*a*c))/2*a
#	print("a=",a,"  b=",b,"  c=",c)
#	print("the roots are:",x1,x2)
	
#sr(1,1,21)

                                  #חישוב שורשי משוואה ריבועית
import math                                       #קריאה לספריית מאט
def sr(a,b,c):                                    #הגדרת פונקציה עם 3 משתנים
	delta = b**2-4*a*c                            # הביטוי מתחת לשורש נכנס לתא דלתא
	if delta < 0:                                 #בדיקה האם דלתא קטנה מאפס
		print("a=",a,"  b=",b,"  c=",c)           #פלט -דיווח על המקדמים 
		print("It's a Math Error")                #פלט-הודעת שגיאה מתימטית-כי לא ניתן לחשב שורש של מספר שלילי
	else:	                                      #אחרת
		x1 = (-b + math.sqrt( delta))/2*a         #חישוב שורש ראשון
		x2 = (-b - math.sqrt( delta))/2*a         #חישוב שורש שני
		print("a=",a,"  b=",b,"  c=",c)           #פלט -דיווח על המקדמים
		print("The Roots are:",x1,x2)             #פלט -דיווח על השורשים
	
sr(1,0,6)                                         #קריאה לפונקציה והשמת ערכים
