                              #  while לולאת   									 
#age = 16                    #השמת ערך
#while age < 18:             #כל עןד הערך קטן מ 18 בצע
#	age = age+1             #הוסף 1 
#	print("not yet 18")     #פלט של הודעה וחזור לבדוק את התנאי
	                        #פלט סופי - פעמיים תודפס ההודעה
	
	
#age = 16                    #השמת ערך
#while age < 18:             #כל עןד הערך קטן מ 18 בצע
#	age = age+1             #הוסף 1
#print("not yet 18")      	#לא תודפס הודעה אלא רק לאחר שהתכנית תצא מהלולאה
                            #ואז תודפס פעם אחת	