                                     #סוגי טיפוסים:שלם,עשרוני,בולליאני,מחרוזת              
#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
   
#	                             # תכנית שמוציאה את סוג המשתנה
# a = 2                    #השמת מספר שלם לאיי
# print(type(a))         

## <class 'int'>           #פלט 

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# a=2.5                  #השמת מספר לא שלם לאיי
# print(type(a))        

## <class 'float'>       #פלט 

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# a = '2'                    #השמת מחרוזת עם גרש אחד לאיי
# print(type(a))            

##<class 'str'>               #פלט

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# a = "2"                    #השמת מחרוזת עם גרשיים כפולים
# print(type(a))             
 
##<class 'str'>             #פלט

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# a = True                  #השמת 'אמת' לתא איי
# print(type(a))             

##<class 'bool'>            #פלט

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# a = False                  #השמת 'אמת' לתא איי
# print(type(a))             

##<class 'bool'>            #פלט

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# a = 2+1                     #השמת תרגיל שתוצאתו היא מספר שלם
# print(type(a))             

##<class 'int'>               #פלט

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# a = "2"+2                  #השמת 'אמת' לתא איי
# print(type(a))             

##TypeError: can only concatenate str (not "int") to str  #פלט-שגיאת טיפוס 

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# x = "2"+"3"+"moti"
# print(type(x))
# print(x)

# # <class 'str'>     #פלט
# # 23moti            #פלט

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# x = 2+3+"moti"
# print(type(x))
# print(x)

##TypeError      #פלט

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# x = 2+3
# print(type(x))
# print(x)

##<class 'int'>     #פלט
##5                 #פלט

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# x = 2==3
# print(type(x))
# print(x)

##<class 'bool'>        #פלט
##False                 #פלט

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@